In [ ]:
# pip install pandas

In [ ]:
import pandas as pd

In [ ]:
# most important object in NumPy??????
# ndarray

import numpy as np

a = np.array([]) # passing lists into arrays
type(a)

# we move one step ahead
# passing in dictionaries

numpy.ndarray

In [ ]:
data = {
    'student': ['idrees','samson','carron','yaya'],
    'math': [35,45,46,32],
    'english': [45,36,41,np.nan]
}

# things called data frames in pandas
data

df = pd.DataFrame(data)
print(df)
type(df)

  student  math  english
0  idrees    35     45.0
1  samson    45     36.0
2  carron    46     41.0
3    yaya    32      NaN

pandas.core.frame.DataFrame

In [ ]:
import pandas as pd

In [ ]:
data = {

    "math" : 53,
    "english" : 43

}

type(data)

data2 = {

    "math" : [53,34,55],
    "english" : [43,34,66]

}

df1 = pd.DataFrame(data2, index = ['a',2,3] ) # set an index of our own - index is related to rows
df1

   math  english
a    53       43
2    34       34
3    55       66

In [ ]:
df1.loc['a'] # target a particular row

math       53
english    43
Name: a, dtype: int64

In [ ]:
import numpy as np

df = pd.DataFrame(np.array([1,2,3]), )

print(df)
type(df)

   0
0  1
1  2
2  3

pandas.core.frame.DataFrame

In [ ]:
df.head() # shows the first rows

dfstudent = df['math']
print(type(dfstudent))

dfstudentmean = df['math'].mean()
print(dfstudentmean)

KeyError: 'math'

In [ ]:
# I want you to create a dictionary 
# That saves 5 cities and temperature

temperatures =

SyntaxError: invalid syntax (2296745542.py, line 4)

In [2]:
city = ("kuala lumpur","petaling jaya","shah alam","subang jaya","putrajaya")
 
trial = {
    city[0]: 32,
    city[1]: 25,          
    city[2]: 31,
    city[3]: 28,
    city[4]: 29
}
 
print(type(trial))

<class 'dict'>

In [3]:
import pandas as pd

df = pd.DataFrame(trial)

ValueError: If using all scalar values, you must pass an index

- python

- numpy : ndarray
    - np.array([])
    - maths calculations

- pandas : DataFrames, Series
    -

In [ ]:
students = {
    'name' : 'idrees',
    'rollno' :43,
    'address' : 'KL Jalan'
}

df = pd.DataFrame(students, index=[1,2,3])
df

     name  rollno   address
1  idrees      43  KL Jalan
2  idrees      43  KL Jalan
3  idrees      43  KL Jalan

In [4]:
city = {
    'KL' : [28,30,39],
    'NY' : [28,30,23],
    'BJ' : [28,44,17],
    'PA' : [34,30,39],
    'BK' : [22,30,19],
    'HK' : [28,22,39]
}


df = pd.DataFrame(city)
df

   KL  NY  BJ  PA  BK  HK
0  28  28  28  34  22  28
1  30  30  44  30  30  22
2  39  23  17  39  19  39

In [8]:
df[['KL','NY','BJ']].min()

KL    28
NY    23
BJ    17
dtype: int64

In [ ]:
city['BJ'] = []
city
type(city['NY'])
city['NY']

[28, 30, 23]

In [ ]:
df['KL']
df['PA']

df['BK']
type(df['BK'])

pandas.core.series.Series

In [ ]:
# dataframes, these are a combination of multiple series elements
# combination of multiple columns
# each column - as 1D dataframe - Series

seriesNum = pd.Series([1,2,3,4,5,6])
type(seriesNum)


seriesNames = pd.Series(["idrees","samson","hariz","balquis","yaya","fathul"])
type(seriesNames)

df = pd.DataFrame(seriesNum)
# dictionary, series, ndarray

print(df)

df['name'] = seriesNames

df["rollno"] = pd.Series([10,20,30,40,50,60])
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

   0     name  rollno
0  1   idrees      10
1  2   samson      20
2  3    hariz      30
3  4  balquis      40
4  5     yaya      50
5  6   fathul      60

In [ ]:
df["averageIncome"] = pd.Series([1000000,2000000,3000000,4000000,5000000,6000000])
df

   0     name  rollno  averageIncome
0  1   idrees      10        1000000
1  2   samson      20        2000000
2  3    hariz      30        3000000
3  4  balquis      40        4000000
4  5     yaya      50        5000000
5  6   fathul      60        6000000

In [ ]:
df['incomeMillions'] = df['averageIncome']/1000000
df

   0     name  rollno  averageIncome  incomeMillions
0  1   idrees      10        1000000             1.0
1  2   samson      20        2000000             2.0
2  3    hariz      30        3000000             3.0
3  4  balquis      40        4000000             4.0
4  5     yaya      50        5000000             5.0
5  6   fathul      60        6000000             6.0

In [ ]:
df.to_csv('income.csv', index = False)

In [ ]:
new_df = pd.read_csv('income.csv')
new_df

   0     name  rollno  averageIncome  incomeMillions
0  1   idrees      10        1000000             1.0
1  2   samson      20        2000000             2.0
2  3    hariz      30        3000000             3.0
3  4  balquis      40        4000000             4.0
4  5     yaya      50        5000000             5.0
5  6   fathul      60        6000000             6.0

In [ ]:
# data frame is nothing but a combination of series objects

series1 = new_df['0']
series2 = new_df['name']
series3 = new_df['rollno']

dfx = pd.DataFrame(series2)

dfx['rollNo'] = series3
dfx

type(new_df['averageIncome'])
new_df['averageIncome']
new_df['incomeMillions']
new_df

   0     name  rollno  averageIncome  incomeMillions
0  1   idrees      10        1000000             1.0
1  2   samson      20        2000000             2.0
2  3    hariz      30        3000000             3.0
3  4  balquis      40        4000000             4.0
4  5     yaya      50        5000000             5.0
5  6   fathul      60        6000000             6.0

In [ ]:
dfr = pd.DataFrame([series1,series2,series3])
dfr

             0       1      2        3     4       5
0            1       2      3        4     5       6
name    idrees  samson  hariz  balquis  yaya  fathul
rollno      10      20     30       40    50      60

In [ ]:
dft = new_df[['name','rollno','averageIncome']]
dft

      name  rollno  averageIncome
0   idrees      10        1000000
1   samson      20        2000000
2    hariz      30        3000000
3  balquis      40        4000000
4     yaya      50        5000000
5   fathul      60        6000000

In [ ]:
iris = pd.read_csv('iris.csv',header=None)

# check your dataset
# head()  tail()


iris.head() # default 5
# iris.tail()

# iris.info()

     0    1    2    3            4
0  5.1  3.5  1.4  0.2  Iris-setosa
1  4.9  3.0  1.4  0.2  Iris-setosa
2  4.7  3.2  1.3  0.2  Iris-setosa
3  4.6  3.1  1.5  0.2  Iris-setosa
4  5.0  3.6  1.4  0.2  Iris-setosa

In [ ]:
iris[4].unique()

# stores data of 3 species of flower

# data -----> algorithm = Trained Model

# input(0,1,2,3) ----> Trained Model -----> specie(s,v,v) === better results

# input(0,1,2,3) , 4, 5, 6 ----> Trained Model2 -----> specie(s,v,v) === better results

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [ ]:
iris[4].duplicated()

0      False
1       True
2       True
3       True
4       True
       ...
145     True
146     True
147     True
148     True
149     True
Name: 4, Length: 150, dtype: bool

In [ ]:
iris[4].unique()

array(['Iris-setosa', 'Iris-versicolor', 'Iris-virginica'], dtype=object)

In [ ]:
iris[4].value_counts()

4
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

In [ ]:
df

   0     name  rollno  averageIncome  incomeMillions
0  1   idrees      10        1000000             1.0
1  2   samson      20        2000000             2.0
2  3    hariz      30        3000000             3.0
3  4  balquis      40        4000000             4.0
4  5     yaya      50        5000000             5.0
5  6   fathul      60        6000000             6.0

axis = 0 --- > row

axis = 1 ----> column

In [ ]:
dfd = df.drop(0,axis=0) # row at 0 index was removed
dfd

   0     name  rollno  averageIncome  incomeMillions
1  2   samson      20        2000000             2.0
2  3    hariz      30        3000000             3.0
3  4  balquis      40        4000000             4.0
4  5     yaya      50        5000000             5.0
5  6   fathul      60        6000000             6.0

In [ ]:
dfd = df.drop(['name',0],axis=1) # column named name was removed
dfd

   rollno  averageIncome  incomeMillions
0      10        1000000             1.0
1      20        2000000             2.0
2      30        3000000             3.0
3      40        4000000             4.0
4      50        5000000             5.0
5      60        6000000             6.0

In [ ]:
iris_without_species = iris.drop(4, axis = 1)
iris_without_species

       0    1    2    3
0    5.1  3.5  1.4  0.2
1    4.9  3.0  1.4  0.2
2    4.7  3.2  1.3  0.2
3    4.6  3.1  1.5  0.2
4    5.0  3.6  1.4  0.2
..   ...  ...  ...  ...
145  6.7  3.0  5.2  2.3
146  6.3  2.5  5.0  1.9
147  6.5  3.0  5.2  2.0
148  6.2  3.4  5.4  2.3
149  5.9  3.0  5.1  1.8

[150 rows x 4 columns]

In [ ]:
species = iris.drop([0,1,2,3], axis= 1)
species

                  4
0       Iris-setosa
1       Iris-setosa
2       Iris-setosa
3       Iris-setosa
4       Iris-setosa
..              ...
145  Iris-virginica
146  Iris-virginica
147  Iris-virginica
148  Iris-virginica
149  Iris-virginica

[150 rows x 1 columns]

In [ ]:
iris2 = iris_without_species
iris2['species'] = species
iris2

       0    1    2    3         species
0    5.1  3.5  1.4  0.2     Iris-setosa
1    4.9  3.0  1.4  0.2     Iris-setosa
2    4.7  3.2  1.3  0.2     Iris-setosa
3    4.6  3.1  1.5  0.2     Iris-setosa
4    5.0  3.6  1.4  0.2     Iris-setosa
..   ...  ...  ...  ...             ...
145  6.7  3.0  5.2  2.3  Iris-virginica
146  6.3  2.5  5.0  1.9  Iris-virginica
147  6.5  3.0  5.2  2.0  Iris-virginica
148  6.2  3.4  5.4  2.3  Iris-virginica
149  5.9  3.0  5.1  1.8  Iris-virginica

[150 rows x 5 columns]

In [ ]:
iris_without_species

       0    1    2    3
0    5.1  3.5  1.4  0.2
1    4.9  3.0  1.4  0.2
2    4.7  3.2  1.3  0.2
3    4.6  3.1  1.5  0.2
4    5.0  3.6  1.4  0.2
..   ...  ...  ...  ...
145  6.7  3.0  5.2  2.3
146  6.3  2.5  5.0  1.9
147  6.5  3.0  5.2  2.0
148  6.2  3.4  5.4  2.3
149  5.9  3.0  5.1  1.8

[150 rows x 4 columns]

In [ ]:
df_petal = iris_without_species[[1,2,3]]

df_petal.loc[2,2] # row colunm


df_petal.loc[:,3] # columnn
df_petal[3]   # columnn

0      0.2
1      0.2
2      0.2
3      0.2
4      0.2
      ...
145    2.3
146    1.9
147    2.0
148    2.3
149    1.8
Name: 3, Length: 150, dtype: float64

In [ ]:
# bringing in data
columns = ['petal_length','petal_width','sepal_length','sepal_width','species']

iris = pd.read_csv('iris.csv', header=None, names=columns)
iris.head()
# iris.shape

   petal_length  petal_width  sepal_length  sepal_width      species
0           5.1          3.5           1.4          0.2  Iris-setosa
1           4.9          3.0           1.4          0.2  Iris-setosa
2           4.7          3.2           1.3          0.2  Iris-setosa
3           4.6          3.1           1.5          0.2  Iris-setosa
4           5.0          3.6           1.4          0.2  Iris-setosa

In [ ]:
iris.iloc[0,3] # row and column number 

iris.iloc[[0,1,2],[1,3]]

   petal_width  sepal_width
0          3.5          0.2
1          3.0          0.2
2          3.2          0.2

In [ ]:
iris.loc[0] # row

iris.loc[:] # print all rows

iris.loc[:,'petal_length'] # access a column

iris.loc[[0,1,2,3,4],['petal_length','petal_width']] # only these rows and only these columns

iris[['petal_length','petal_width']]

# iris['petal_length'][5]

     petal_length  petal_width
0             5.1          3.5
1             4.9          3.0
2             4.7          3.2
3             4.6          3.1
4             5.0          3.6
..            ...          ...
145           6.7          3.0
146           6.3          2.5
147           6.5          3.0
148           6.2          3.4
149           5.9          3.0

[150 rows x 2 columns]

In [ ]:
# Filtering

iris[iris['petal_width'] < 6]

     petal_length  petal_width  sepal_length  sepal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [ ]:
income = pd.read_csv("income.csv")

income.head(2)

   0    name  rollno  averageIncome  incomeMillions
0  1  idrees      10        1000000             1.0
1  2  samson      20        2000000             2.0

In [ ]:
x = income[(income['incomeMillions'] <5)]

x = x.sort_values(by='incomeMillions', ascending= False)
x

   0     name  rollno  averageIncome  incomeMillions
3  4  balquis      40        4000000             4.0
2  3    hariz      30        3000000             3.0
1  2   samson      20        2000000             2.0
0  1   idrees      10        1000000             1.0

In [ ]:
print(f"{x.iloc[0,1]} is very rich, and has an income of: {x.iloc[0,4]} millions")

# balquis    4.0

balquis is very rich, and has an income of: 4.0 millions

In [ ]:
x[['rollno','averageIncome']].mean()
x.loc[[3,2],['rollno', 'averageIncome']].mean()

rollno                35.0
averageIncome    3500000.0
dtype: float64